Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: أفأمنتم أن يخسف بكم جانب البر أو يرسل عليكم حاصبا ثم لا تجدوا لكم وكيلا
en: Do you then feel secure that He will not cause a side of the land to swallow you up, or that He will not send against you a violent sand-storm? Then, you shall find no Wakil (guardian - one to guard you from the torment).

source: أم أمنتم أن يعيدكم فيه تارة أخرى فيرسل عليكم قاصفا من الريح فيغرقكم بما كفرتم ثم لا تجدوا لكم علينا به تبيعا
en: Or do you feel secure that He will not send you back a second time to sea and send against you a hurricane of wind and drown you because of your disbelief? Then you will not find any avenger therein against Us.

source: ولقد كرمنا بني آدم وحملناهم في البر والبحر ورزقناهم من الطيبات وفضلناهم على كثير ممن خلقنا تفضيلا
en: And indeed We have honoured the Children of Adam, and We have carried them on land and sea, and have provided them with At-Tayyibat (lawful good things), and have preferred them above many of those whom We have created with a marked preferment.

source: يوم ندعو كل أناس بإمامهم فمن أوتي كتابه بيمينه فأولئك يقرءون كتابهم ولا يظلمون فتيلا
en: (And remember) the Day when We shall call together call human beings with their (respective) Imam [their Prophets, or their records of good and bad deeds, or their Holy Books like the Qur'an, the Taurat (Torah), the Injeel (Gospel), the leaders whom the people followed in this world.]. So whosoever is given his record in his right hand, such will read their records, and they will not be dealt with unjustly in the least.

source: ومن كان في هذه أعمى فهو في الآخرة أعمى وأضل سبيلا
en: And whoever is blind in this world (i.e., does not see Allah's Signs and believes not in Him), will be blind in the Hereafter, and more astray from the Path.

source: وإن كادوا ليفتنونك عن الذي أوحينا إليك لتفتري علينا غيره وإذا لاتخذوك خليلا
en: Verily, they were about to tempt you away from that which We have revealed (the Qur'an) unto you (O Muhammad صلى الله عليه و سلم), to fabricate something other than it against Us, and then they would certainly have taken you a Khalil (an intimate friend)!

source: ولولا أن ثبتناك لقد كدت تركن إليهم شيئا قليلا
en: And had We not made you stand firm, you would nearly have inclined to them a little.

source: إذا لأذقناك ضعف الحياة وضعف الممات ثم لا تجد لك علينا نصيرا
en: In that case We would have made you taste a double portion (of punishment) in this life and a double portion (of punishment) after death. And then you would have found none to help you against Us.

source: وإن كادوا ليستفزونك من الأرض ليخرجوك منها وإذا لا يلبثون خلافك إلا قليلا
en: And verily they were about to frighten you so much as to drive you out from the land. But in that case they would not have stayed (therein) after you, except for a little while.

source: سنة من قد أرسلنا قبلك من رسلنا ولا تجد لسنتنا تحويلا
en: (This was Our) Sunnah (rule or way) with the Messengers We sent before you (O Muhammad صلى الله عليه و سلم), and you will not find any alteration in Our Sunnah (rule or way).

source: أقم الصلاة لدلوك الشمس إلى غسق الليل وقرآن الفجر إن قرآن الفجر كان مشهودا
en: Perform As-Salat (Iqamat-as-Salat) from mid-day till the darkness of the night (i.e. the Zuhr, 'Asr, Maghrib and 'Isha' prayers), and recite the Qur'an in the early dawn (i.e. the morning prayer). Verily, the recitation of the Qur'an in the early dawn is ever witnessed (attended by the angels in charge of mankind of the day and the night) .

source: ومن الليل فتهجد به نافلة لك عسى أن يبعثك ربك مقاما محمودا
en: And in some parts of the night (also) offer the Salat (prayer) with it (i.e. recite the Qur'an in the prayer), as an additional prayer (Tahajjud optional prayer - Nawafil) for you (O Muhammad صلى الله عليه و سلم). It may be that your Lord will raise you to Maqam Mahmud (a station of praise and glory, i.e. the honour of intercession on the Day of Resurrection.) .

source: وقل رب أدخلني مدخل صدق وأخرجني مخرج صدق واجعل لي من لدنك سلطانا نصيرا
en: And say (O Muhammad صلى الله عليه و سلم): My Lord! Let my entry (to the city of Al-Madinah) be good, and (likewise) my exit (from the city of Makkah) be good. And grant me from You an authority to help me (or a firm sign or a proof).

source: وقل جاء الحق وزهق الباطل إن الباطل كان زهوقا
en: And say: "Truth (i.e. Islamic Monotheism or this Qur'an or Jihad against polytheists) has come and Batil (falsehood, i.e. Satan or polytheism) has vanished. Surely Batil is ever bound to vanish."

source: وننزل من القرآن ما هو شفاء ورحمة للمؤمنين ولا يزيد الظالمين إلا خسارا
en: And We send down of the Qur'an that which is a healing and a mercy to those who believe (in Islamic Monotheism and act on it), and it increases the Zalimun (polytheists and wrong-doers) nothing but loss.

source: وإذا أنعمنا على الإنسان أعرض ونأى بجانبه وإذا مسه الشر كان يئوسا
en: And when We bestow Our Grace on man (the disbeliever), he turns away and becomes arrogant (far away from the Right Path). And when evil touches him, he is in great despair.

source: قل كل يعمل على شاكلته فربكم أعلم بمن هو أهدى سبيلا
en: Say (O Muhammad صلى الله عليه و سلم to mankind): "Each one does according to Shakilatihi (i.e. his way or his religion or his intentions.), and your Lord knows best of him whose path (religion) is right."

source: ويسألونك عن الروح قل الروح من أمر ربي وما أوتيتم من العلم إلا قليلا
en: And they ask you (O Muhammad صلى الله عليه و سلم) concerning the Ruh (the Spirit); Say: "The Ruh (the Spirit) is one of the things, the knowledge of which is only with my Lord. And of knowledge, you (mankind) have been given only a little."

source: ولئن شئنا لنذهبن بالذي أوحينا إليك ثم لا تجد لك به علينا وكيلا
en: And if We willed, We could surely take away that which We have revealed to you (i.e. this Qur'an). Then you would find no protector for you against Us in that respect.

source: إلا رحمة من ربك إن فضله كان عليك كبيرا
en: Except as a Mercy from your Lord. Verily His Grace unto you (O Muhammad صلى الله عليه و سلم) is ever great.

source: قل لئن اجتمعت الإنس والجن على أن يأتوا بمثل هذا القرآن لا يأتون بمثله ولو كان بعضهم لبعض ظهيرا
en: Say: "If the mankind and the jinn were together to produce the like of this Qur'an, they could not produce the like thereof, even if they helped one another."

source: ولقد صرفنا للناس في هذا القرآن من كل مثل فأبى أكثر الناس إلا كفورا
en: And indeed We have fully explained to mankind, in this Qur'an, every kind of similitude, but most of mankind refuse (the truth and accept nothing) but disbelief.

source: وقالوا لن نؤمن لك حتى تفجر لنا من الأرض ينبوعا
en: And they say: "We shall not believe in you (O Muhammad صلى الله عليه و سلم), until you cause a spring to gush forth from the earth for us;

source: أو تكون لك جنة من نخيل وعنب فتفجر الأنهار خلالها تفجيرا
en: "Or you have a garden of date-palms and grapes, and cause rivers to gush forth in their midst abundantly;

source: أو تسقط السماء كما زعمت علينا كسفا أو تأتي بالله والملائكة قبيلا
en: "Or you cause the heaven to fall upon us in pieces, as you have pretended, or you bring Allah and the angels before (us) face to face;

source: أو يكون لك بيت من زخرف أو ترقى في السماء ولن نؤمن لرقيك حتى تنزل علينا كتابا نقرؤه قل سبحان ربي هل كنت إلا بشرا رسولا
en: "Or you have a house of Zukhruf (like silver and pure gold), or you ascend up into the sky, and even then we will put no faith in your ascension until you bring down for us a Book that we would read." Say (O Muhammad صلى الله عليه و سلم): "Glorified (and Exalted) be my Lord [(Allah) above all that evil they (polytheists) associate with Him]! Am I anything but a man, sent as a Messenger?"

source: وما منع الناس أن يؤمنوا إذ جاءهم الهدى إلا أن قالوا أبعث الله بشرا رسولا
en: And nothing prevented men from believing when the guidance came to them, except that they said: "Has Allah sent a man as (His) Messenger?"

source: قل لو كان في الأرض ملائكة يمشون مطمئنين لنزلنا عليهم من السماء ملكا رسولا
en: Say: "If there were on the earth, angels walking about in peace and security, We should certainly have sent down for them from the heaven an angel as a Messenger."

source: قل كفى بالله شهيدا بيني وبينكم إنه كان بعباده خبيرا بصيرا
en: Say: "Sufficient is Allah for a witness between me and you. Verily He is Ever the All-Knower, the All-Seer of His slaves."

source: ومن يهد الله فهو المهتد ومن يضلل فلن تجد لهم أولياء من دونه ونحشرهم يوم القيامة على وجوههم عميا وبكما وصما مأواهم جهنم كلما خبت زدناهم سعيرا
en: And he whom Allah guides, he is led aright; but he whom He sends astray, for such you will find no Auliya' (helpers and protectors), besides Him, and We shall gather them together on the Day of Resurrection on their faces, blind, dumb and deaf; their abode will be Hell; whenever it abates, We shall increase for them the fierceness of the Fire.

source: ذلك جزاؤهم بأنهم كفروا بآياتنا وقالوا أإذا كنا عظاما ورفاتا أإنا لمبعوثون خلقا جديدا
en: That is their recompense, because they denied Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) and said: "When we are bones and fragments, shall we really be raised up as a new creation?"

source: أولم يروا أن الله الذي خلق السماوات والأرض قادر على أن يخلق مثلهم وجعل لهم أجلا لا ريب فيه فأبى الظالمون إلا كفورا
en: See they not that Allah, Who created the heavens and the earth, is Able to create the like of them. And He has decreed for them an appointed term, whereof there is no doubt. But the Zalimun (polytheists and wrong-doers) refuse (the truth - the Message of Islamic Monotheism, and accept nothing) but disbelief.

source: قل لو أنتم تملكون خزائن رحمة ربي إذا لأمسكتم خشية الإنفاق وكان الإنسان قتورا
en: Say (to the disbelievers): "If you possessed the treasure of the Mercy of my Lord (wealth, money, provision.), then you would surely hold back (from spending) for fear of (being exhausted), and man is ever miserly!"

source: ولقد آتينا موسى تسع آيات بينات فاسأل بني إسرائيل إذ جاءهم فقال له فرعون إني لأظنك يا موسى مسحورا
en: And indeed We gave Musa (Moses) nine clear signs. Ask then the Children of Israel, when he came to them, then Fir'aun (Pharaoh) said to him: "O Musa (Moses)! I think you are indeed bewitched."

source: قال لقد علمت ما أنزل هؤلاء إلا رب السماوات والأرض بصائر وإني لأظنك يا فرعون مثبورا
en: [Musa (Moses)] said: "Verily, you know that these signs have been sent down by none but the Lord of the heavens and the earth (as clear evidence i.e. proofs of Allah's Oneness and His Omnipotence.). And I think you are, indeed, O Fir'aun (Pharaoh) doomed to destruction (away from all good)!"

source: فأراد أن يستفزهم من الأرض فأغرقناه ومن معه جميعا
en: So he resolved to turn them out of the land (of Egypt). But We drowned him and all who were with him.

source: وقلنا من بعده لبني إسرائيل اسكنوا الأرض فإذا جاء وعد الآخرة جئنا بكم لفيفا
en: And We said to the Children of Israel after him: "Dwell in the land, then, when the final and the last promise comes near [i.e. the Day of Resurrection or the descent of Christ ['Îsa (Jesus), son of Maryam (Mary) عليهما السلام on the earth], We shall bring you altogether as mixed crowd (gathered out of various nations). (Tafsir Al-Qurtubi,).

source: وبالحق أنزلناه وبالحق نزل وما أرسلناك إلا مبشرا ونذيرا
en: And with truth We have sent it down (i.e. the Qur'an), and with truth it has descended. And We have sent you (O Muhammad صلى الله عليه و سلم) as nothing but a bearer of glad tidings (of Paradise for those who follow your Message of Islamic Monotheism), and a warner (of Hell-fire for those who refuse to follow your Message of Islamic Monotheism) .

source: وقرآنا فرقناه لتقرأه على الناس على مكث ونزلناه تنزيلا
en: And (it is) a Qur'an which We have divided (into parts), in order that you might recite it to men at intervals. And We have revealed it by stages (in 23 years).

source: قل آمنوا به أو لا تؤمنوا إن الذين أوتوا العلم من قبله إذا يتلى عليهم يخرون للأذقان سجدا
en: Say (O Muhammad صلى الله عليه و سلم to them): "Believe in it (the Qur'an) or do not believe (in it). Verily those who were given knowledge before it (the Jews and the Christians like 'Abdullah bin Salam and Salman Al-Farisi), when it is recited to them, fall down on their faces in humble prostration."

source: ويقولون سبحان ربنا إن كان وعد ربنا لمفعولا
en: And they say: "Glory be to our Lord! Truly, the Promise of our Lord must be fulfilled."

source: ويخرون للأذقان يبكون ويزيدهم خشوعا
en: And they fall down on their faces weeping and it increases their humility.

source: قل ادعوا الله أو ادعوا الرحمن أيا ما تدعوا فله الأسماء الحسنى ولا تجهر بصلاتك ولا تخافت بها وابتغ بين ذلك سبيلا
en: Say (O Muhammad صلى الله عليه و سلم): "Invoke Allah or invoke the Most Gracious (Allah), by whatever name you invoke Him (it is the same), for to Him belong the Best Names. And offer your Salat (prayer) neither aloud nor in a low voice, but follow a way between.

source: وقل الحمد لله الذي لم يتخذ ولدا ولم يكن له شريك في الملك ولم يكن له ولي من الذل وكبره تكبيرا
en: And say: "All the praises and thanks be to Allah, Who has not begotten a son (or offspring), and Who has no partner in (His) Dominion, nor He is low to have a Wali (helper, protector or supporter). And magnify Him with all magnificence, [Allahu-Akbar (Allah is the Most Great)]."

source: الحمد لله الذي أنزل على عبده الكتاب ولم يجعل له عوجا
en: All the praises and thanks be to Allah, Who has sent down to His slave (Muhammad صلى الله عليه وسلم) the Book (the Qur'an), and has not placed therein any crookedness.

source: قيما لينذر بأسا شديدا من لدنه ويبشر المؤمنين الذين يعملون الصالحات أن لهم أجرا حسنا
en: (He has made it) straight to give warning (to the disbelievers) of a severe punishment from Him, and to give glad tidings to the believers (in the Oneness of Allah - Islamic Monotheism), who do righteous deeds, that they shall have a fair reward (i.e. Paradise).

source: ماكثين فيه أبدا
en: They shall abide therein for ever.

source: وينذر الذين قالوا اتخذ الله ولدا
en: And to warn those (Jews, Christians, and pagans) who say, "Allah has begotten a son (or offspring or children)."

source: ما لهم به من علم ولا لآبائهم كبرت كلمة تخرج من أفواههم إن يقولون إلا كذبا
en: No knowledge have they of such a thing, nor had their fathers. Mighty is the word that comes out of their mouths [i.e. He begot sons and daughters]. They utter nothing but a lie .

source: فلعلك باخع نفسك على آثارهم إن لم يؤمنوا بهذا الحديث أسفا
en: Perhaps, you, would kill yourself (O Muhammad صلى الله عليه وسلم) in grief, over their footsteps (for their turning away from you), because they believe not in this narration (the Qur'an).

source: إنا جعلنا ما على الأرض زينة لها لنبلوهم أيهم أحسن عملا
en: Verily! We have made that which is on earth as an adornment for it, in order that We may test them (mankind) as to which of them are best in deeds. [i.e. those who do good deeds in the most perfect manner, that means to do them (deeds) totally for Allah's sake and in accordance to the legal ways of the Prophet صلى الله عليه وسلم].

source: وإنا لجاعلون ما عليها صعيدا جرزا
en: And verily We shall make all that is on it (the earth) a bare dry soil (without any vegetation or trees.).

source: أم حسبت أن أصحاب الكهف والرقيم كانوا من آياتنا عجبا
en: Do you think that the people of the Cave and the Inscription (the news or the names of the people of the Cave) were a wonder among Our Signs?

source: إذ أوى الفتية إلى الكهف فقالوا ربنا آتنا من لدنك رحمة وهيئ لنا من أمرنا رشدا
en: (Remember) when the young men fled for refuge (from their disbelieving folk) to the Cave. They said: "Our Lord! Bestow on us mercy from Yourself, and facilitate for us our affair in the right way!"

source: فضربنا على آذانهم في الكهف سنين عددا
en: Therefore We covered up their (sense of) hearing (causing them to go in deep sleep) in the Cave for a number of years.

source: ثم بعثناهم لنعلم أي الحزبين أحصى لما لبثوا أمدا
en: Then We raised them up (from their sleep), that We might test which of the two parties was best at calculating the time period that they had tarried.

source: نحن نقص عليك نبأهم بالحق إنهم فتية آمنوا بربهم وزدناهم هدى
en: We narrate unto you (O Muhammad صلى الله عليه وسلم) their story with truth: Truly they were young men who believed in their Lord (Allah), and We increased them in guidance.

source: وربطنا على قلوبهم إذ قاموا فقالوا ربنا رب السماوات والأرض لن ندعو من دونه إلها لقد قلنا إذا شططا
en: And We made their hearts firm and strong (with the light of Faith in Allah and bestowed upon them patience to bear the separation of their kith and kin and dwellings) when they stood up and said: "Our Lord is the Lord of the heavens and the earth, never shall we call upon any ilah (god) other than Him; if we did, we should indeed have uttered an enormity in disbelief.

source: هؤلاء قومنا اتخذوا من دونه آلهة لولا يأتون عليهم بسلطان بين فمن أظلم ممن افترى على الله كذبا
en: "These our people have taken for worship alihah (gods) other than Him (Allah). Why do they not bring for them a clear authority? And who does more wrong than he who invents a lie against Allah.

source: وإذ اعتزلتموهم وما يعبدون إلا الله فأووا إلى الكهف ينشر لكم ربكم من رحمته ويهيئ لكم من أمركم مرفقا
en: (The young men said to one another): "And when you withdraw from them, and that which they worship, except Allah, then seek refuge in the Cave; your Lord will open a way for you from His Mercy and will make easy for you your affair (i.e. will give you what you will need of provision, dwelling)."

source: وترى الشمس إذا طلعت تزاور عن كهفهم ذات اليمين وإذا غربت تقرضهم ذات الشمال وهم في فجوة منه ذلك من آيات الله من يهد الله فهو المهتد ومن يضلل فلن تجد له وليا مرشدا
en: And you might have seen the sun, when it rose, declining to the right from their Cave, and when it set, turning away from them to the left, while they lay in the midst of the Cave. That is (one) of the Ayat (proofs, evidence, signs) of Allah. He whom Allah guides, he is the rightly guided; but he whom He sends astray, for him you will find no Wali (guiding friend) to lead him (to the right Path).

source: وتحسبهم أيقاظا وهم رقود ونقلبهم ذات اليمين وذات الشمال وكلبهم باسط ذراعيه بالوصيد لو اطلعت عليهم لوليت منهم فرارا ولملئت منهم رعبا
en: And you would have thought them awake, whereas they were asleep. And We turned them on their right and on their left sides, and their dog stretching forth his two forelegs at the entrance [of the Cave or in the space near to the entrance of the Cave (as a guard at the gate)]. Had you looked at them, you would certainly have turned back from them in flight, and would certainly have been filled with awe of them.

source: وكذلك بعثناهم ليتساءلوا بينهم قال قائل منهم كم لبثتم قالوا لبثنا يوما أو بعض يوم قالوا ربكم أعلم بما لبثتم فابعثوا أحدكم بورقكم هذه إلى المدينة فلينظر أيها أزكى طعاما فليأتكم برزق منه وليتلطف ولا يشعرن بكم أحدا
en: Likewise, We awakened them (from their long deep sleep) that they might question one another. A speaker from among them said: "How long have you stayed (here)?" They said: "We have stayed (perhaps) a day or part of a day." They said: "Your Lord (Alone) knows best how long you have stayed (here). So send one of you with this silver coin of yours to the town, and let him find out which is the good lawful food, and bring some of that to you. And let him be careful and let no man know of you.

source: إنهم إن يظهروا عليكم يرجموكم أو يعيدوكم في ملتهم ولن تفلحوا إذا أبدا
en: "For, if they come to know of you, they will stone you (to death or abuse and harm you) or turn you back to their religion; and in that case you will never be successful."

source: وكذلك أعثرنا عليهم ليعلموا أن وعد الله حق وأن الساعة لا ريب فيها إذ يتنازعون بينهم أمرهم فقالوا ابنوا عليهم بنيانا ربهم أعلم بهم قال الذين غلبوا على أمرهم لنتخذن عليهم مسجدا
en: And thus We made their case known (to the people), that they might know that the Promise of Allah is true, and that there can be no doubt about the Hour. (Remember) when they (the people of the city) disputed among themselves about their case, they said: "Construct a building over them; their Lord knows best about them;" (then) those who won their point said (most probably the disbelievers): "We verily shall build a place of worship over them."

source: سيقولون ثلاثة رابعهم كلبهم ويقولون خمسة سادسهم كلبهم رجما بالغيب ويقولون سبعة وثامنهم كلبهم قل ربي أعلم بعدتهم ما يعلمهم إلا قليل فلا تمار فيهم إلا مراء ظاهرا ولا تستفت فيهم منهم أحدا
en: (Some) say they were three, the dog being the fourth among them; and (others) say they were five, the dog being the sixth, - guessing at the unseen; (yet others) say they were seven, and the dog being the eighth. Say (O Muhammad صلى الله عليه وسلم): "My Lord knows best their number; none knows them but a few." So debate not (about their number) except with the clear proof (which We have revealed to you). And consult not any of them (people of the Scripture - Jews and Christians) about (the affair of) the people of the Cave.

source: ولا تقولن لشيء إني فاعل ذلك غدا
en: And never say of anything, "I shall do such and such thing tomorrow."

source: إلا أن يشاء الله واذكر ربك إذا نسيت وقل عسى أن يهدين ربي لأقرب من هذا رشدا
en: Except (with the saying), "If Allah will!" And remember your Lord when you forget and say: "It may be that my Lord guides me unto a nearer way of truth than this."

source: ولبثوا في كهفهم ثلاث مائة سنين وازدادوا تسعا
en: And they stayed in their Cave three hundred (solar) years, adding nine (for lunar years). (Tafsir Al-Qurtubi)

source: قل الله أعلم بما لبثوا له غيب السماوات والأرض أبصر به وأسمع ما لهم من دونه من ولي ولا يشرك في حكمه أحدا
en: Say: "Allah knows best how long they stayed. With Him is (the knowledge of) the Unseen of the heavens and the earth. How clearly He sees, and hears (everything)! They have no Wali (Helper, Disposer of affairs, Protector) other than Him, and He makes none to share in His Decision and His Rule."

source: واتل ما أوحي إليك من كتاب ربك لا مبدل لكلماته ولن تجد من دونه ملتحدا
en: And recite what has been revealed to you (O Muhammad صلى الله عليه وسلم) of the Book (the Qur'an) of your Lord (i.e. recite it, understand and follow its teachings and act on its orders and preach it to men). None can change His Words, and none will you find as a refuge other than Him.

source: واصبر نفسك مع الذين يدعون ربهم بالغداة والعشي يريدون وجهه ولا تعد عيناك عنهم تريد زينة الحياة الدنيا ولا تطع من أغفلنا قلبه عن ذكرنا واتبع هواه وكان أمره فرطا
en: And keep yourself (O Muhammad صلى الله عليه وسلم) patiently with those who call on their Lord (i.e. your companions who remember their Lord with glorification, praising in prayers, and other righteous deeds) morning and afternoon, seeking His Face; and let not your eyes overlook them, desiring the pomp and glitter of the life of the world; and obey not him whose heart We have made heedless of Our Remembrance, and who follows his own lusts, and whose affair (deeds) has been lost.

source: وقل الحق من ربكم فمن شاء فليؤمن ومن شاء فليكفر إنا أعتدنا للظالمين نارا أحاط بهم سرادقها وإن يستغيثوا يغاثوا بماء كالمهل يشوي الوجوه بئس الشراب وساءت مرتفقا
en: And say: "The truth is from your Lord." Then whosoever wills, let him believe; and whosoever wills, let him disbelieve. Verily, We have prepared for the Zalimun (polytheists and wrong-doers.), a Fire whose walls will be surrounding them (disbelievers in the Oneness of Allah). And if they ask for help (relief, water), they will be granted water like boiling oil, that will scald their faces. Terrible is the drink, and an evil Murtafaq (dwelling, resting place.)!

source: إن الذين آمنوا وعملوا الصالحات إنا لا نضيع أجر من أحسن عملا
en: Verily as for those who believed and did righteous deeds, certainly We shall not make the reward of anyone who does his (righteous) deeds in the most perfect manner to be lost.
